{"class_name": "Functional", "config": {"name": "vggface_resnet50", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv1/7x7_s2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1/7x7_s2", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv1/7x7_s2/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv1/7x7_s2/bn", "inbound_nodes": [[["conv1/7x7_s2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_98", "inbound_nodes": [[["conv1/7x7_s2/bn", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_98", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_1_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_1_1x1_reduce", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_1_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_1_1x1_reduce/bn", "inbound_nodes": [[["conv2_1_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_99", "inbound_nodes": [[["conv2_1_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_1_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_1_3x3", "inbound_nodes": [[["activation_99", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_1_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_1_3x3/bn", "inbound_nodes": [[["conv2_1_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_100", "inbound_nodes": [[["conv2_1_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_1_1x1_increase", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_1_1x1_increase", "inbound_nodes": [[["activation_100", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_1_1x1_proj", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_1_1x1_proj", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_1_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_1_1x1_increase/bn", "inbound_nodes": [[["conv2_1_1x1_increase", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_1_1x1_proj/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_1_1x1_proj/bn", "inbound_nodes": [[["conv2_1_1x1_proj", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_32", "trainable": true, "dtype": "float32"}, "name": "add_32", "inbound_nodes": [[["conv2_1_1x1_increase/bn", 0, 0, {}], ["conv2_1_1x1_proj/bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_101", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_101", "inbound_nodes": [[["add_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_2_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_2_1x1_reduce", "inbound_nodes": [[["activation_101", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_2_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_2_1x1_reduce/bn", "inbound_nodes": [[["conv2_2_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_102", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_102", "inbound_nodes": [[["conv2_2_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_2_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_2_3x3", "inbound_nodes": [[["activation_102", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_2_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_2_3x3/bn", "inbound_nodes": [[["conv2_2_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_103", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_103", "inbound_nodes": [[["conv2_2_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_2_1x1_increase", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_2_1x1_increase", "inbound_nodes": [[["activation_103", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_2_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_2_1x1_increase/bn", "inbound_nodes": [[["conv2_2_1x1_increase", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_33", "trainable": true, "dtype": "float32"}, "name": "add_33", "inbound_nodes": [[["conv2_2_1x1_increase/bn", 0, 0, {}], ["activation_101", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_104", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_104", "inbound_nodes": [[["add_33", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_3_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_3_1x1_reduce", "inbound_nodes": [[["activation_104", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_3_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_3_1x1_reduce/bn", "inbound_nodes": [[["conv2_3_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_105", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_105", "inbound_nodes": [[["conv2_3_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_3_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_3_3x3", "inbound_nodes": [[["activation_105", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_3_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_3_3x3/bn", "inbound_nodes": [[["conv2_3_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_106", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_106", "inbound_nodes": [[["conv2_3_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_3_1x1_increase", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_3_1x1_increase", "inbound_nodes": [[["activation_106", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_3_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_3_1x1_increase/bn", "inbound_nodes": [[["conv2_3_1x1_increase", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_34", "trainable": true, "dtype": "float32"}, "name": "add_34", "inbound_nodes": [[["conv2_3_1x1_increase/bn", 0, 0, {}], ["activation_104", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_107", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_107", "inbound_nodes": [[["add_34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_1_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_1_1x1_reduce", "inbound_nodes": [[["activation_107", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_1_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_1_1x1_reduce/bn", "inbound_nodes": [[["conv3_1_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_108", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_108", "inbound_nodes": [[["conv3_1_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_1_3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_1_3x3", "inbound_nodes": [[["activation_108", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_1_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_1_3x3/bn", "inbound_nodes": [[["conv3_1_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_109", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_109", "inbound_nodes": [[["conv3_1_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_1_1x1_increase", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_1_1x1_increase", "inbound_nodes": [[["activation_109", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_1_1x1_proj", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_1_1x1_proj", "inbound_nodes": [[["activation_107", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_1_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_1_1x1_increase/bn", "inbound_nodes": [[["conv3_1_1x1_increase", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_1_1x1_proj/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_1_1x1_proj/bn", "inbound_nodes": [[["conv3_1_1x1_proj", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_35", "trainable": true, "dtype": "float32"}, "name": "add_35", "inbound_nodes": [[["conv3_1_1x1_increase/bn", 0, 0, {}], ["conv3_1_1x1_proj/bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_110", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_110", "inbound_nodes": [[["add_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_2_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_2_1x1_reduce", "inbound_nodes": [[["activation_110", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_2_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_2_1x1_reduce/bn", "inbound_nodes": [[["conv3_2_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_111", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_111", "inbound_nodes": [[["conv3_2_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_2_3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_2_3x3", "inbound_nodes": [[["activation_111", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_2_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_2_3x3/bn", "inbound_nodes": [[["conv3_2_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_112", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_112", "inbound_nodes": [[["conv3_2_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_2_1x1_increase", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_2_1x1_increase", "inbound_nodes": [[["activation_112", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_2_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_2_1x1_increase/bn", "inbound_nodes": [[["conv3_2_1x1_increase", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_36", "trainable": true, "dtype": "float32"}, "name": "add_36", "inbound_nodes": [[["conv3_2_1x1_increase/bn", 0, 0, {}], ["activation_110", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_113", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_113", "inbound_nodes": [[["add_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_3_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_3_1x1_reduce", "inbound_nodes": [[["activation_113", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_3_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_3_1x1_reduce/bn", "inbound_nodes": [[["conv3_3_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_114", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_114", "inbound_nodes": [[["conv3_3_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_3_3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_3_3x3", "inbound_nodes": [[["activation_114", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_3_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_3_3x3/bn", "inbound_nodes": [[["conv3_3_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_115", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_115", "inbound_nodes": [[["conv3_3_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_3_1x1_increase", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_3_1x1_increase", "inbound_nodes": [[["activation_115", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_3_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_3_1x1_increase/bn", "inbound_nodes": [[["conv3_3_1x1_increase", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_37", "trainable": true, "dtype": "float32"}, "name": "add_37", "inbound_nodes": [[["conv3_3_1x1_increase/bn", 0, 0, {}], ["activation_113", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_116", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_116", "inbound_nodes": [[["add_37", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_4_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_4_1x1_reduce", "inbound_nodes": [[["activation_116", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_4_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_4_1x1_reduce/bn", "inbound_nodes": [[["conv3_4_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_117", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_117", "inbound_nodes": [[["conv3_4_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_4_3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_4_3x3", "inbound_nodes": [[["activation_117", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_4_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_4_3x3/bn", "inbound_nodes": [[["conv3_4_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_118", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_118", "inbound_nodes": [[["conv3_4_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_4_1x1_increase", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_4_1x1_increase", "inbound_nodes": [[["activation_118", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_4_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_4_1x1_increase/bn", "inbound_nodes": [[["conv3_4_1x1_increase", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_38", "trainable": true, "dtype": "float32"}, "name": "add_38", "inbound_nodes": [[["conv3_4_1x1_increase/bn", 0, 0, {}], ["activation_116", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_119", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_119", "inbound_nodes": [[["add_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_1_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_1_1x1_reduce", "inbound_nodes": [[["activation_119", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_1_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_1_1x1_reduce/bn", "inbound_nodes": [[["conv4_1_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_120", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_120", "inbound_nodes": [[["conv4_1_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_1_3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_1_3x3", "inbound_nodes": [[["activation_120", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_1_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_1_3x3/bn", "inbound_nodes": [[["conv4_1_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_121", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_121", "inbound_nodes": [[["conv4_1_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_1_1x1_increase", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_1_1x1_increase", "inbound_nodes": [[["activation_121", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_1_1x1_proj", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_1_1x1_proj", "inbound_nodes": [[["activation_119", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_1_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_1_1x1_increase/bn", "inbound_nodes": [[["conv4_1_1x1_increase", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_1_1x1_proj/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_1_1x1_proj/bn", "inbound_nodes": [[["conv4_1_1x1_proj", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_39", "trainable": true, "dtype": "float32"}, "name": "add_39", "inbound_nodes": [[["conv4_1_1x1_increase/bn", 0, 0, {}], ["conv4_1_1x1_proj/bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_122", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_122", "inbound_nodes": [[["add_39", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_2_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_2_1x1_reduce", "inbound_nodes": [[["activation_122", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_2_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_2_1x1_reduce/bn", "inbound_nodes": [[["conv4_2_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_123", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_123", "inbound_nodes": [[["conv4_2_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_2_3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_2_3x3", "inbound_nodes": [[["activation_123", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_2_3x3/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_2_3x3/bn", "inbound_nodes": [[["conv4_2_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_124", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_124", "inbound_nodes": [[["conv4_2_3x3/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_2_1x1_increase", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_2_1x1_increase", "inbound_nodes": [[["activation_124", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_2_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_2_1x1_increase/bn", "inbound_nodes": [[["conv4_2_1x1_increase", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_40", "trainable": true, "dtype": "float32"}, "name": "add_40", "inbound_nodes": [[["conv4_2_1x1_increase/bn", 0, 0, {}], ["activation_122", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_125", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_125", "inbound_nodes": [[["add_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_3_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_3_1x1_reduce", "inbound_nodes": [[["activation_125", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_3_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_3_1x1_reduce/bn", "inbound_nodes": [[["conv4_3_1x1_reduce", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_126", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_126", "inbound_nodes": [[["conv4_3_1x1_reduce/bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_3_3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, 